In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('Kolkata.csv')
data['price'] = data['price'] / 100000

In [3]:
data.head()

      price  sqft     location  bathrooms  bhk            area_type
0  22.35000  1016      Barasat        2.0    1  Super built-up Area
1  36.65999  1111    Keshtopur        5.0    3            Plot Area
2  37.74000  1020     Rajarhat        2.0    3        Built-up Area
3  25.24000   935  Narendrapur        3.0    2  Super built-up Area
4  83.00000  1956     New Town        2.0    4  Super built-up Area

In [4]:
data.shape

(6507, 6)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6507 entries, 0 to 6506
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      6507 non-null   float64
 1   sqft       6507 non-null   int64
 2   location   6507 non-null   object
 3   bathrooms  6470 non-null   float64
 4   bhk        6507 non-null   int64
 5   area_type  6507 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 305.1+ KB

In [6]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

40.00000    99
45.00000    97
55.00000    96
35.00000    94
65.00000    93
            ..
35.61999     1
33.82000     1
31.18000     1
47.12000     1
37.60000     1
Name: price, Length: 1660, dtype: int64
********************
800     141
750      98
1100     89
850      85
1200     81
       ...
1874      1
3060      1
1033      1
1057      1
2073      1
Name: sqft, Length: 1188, dtype: int64
********************
New Town                   711
Rajarhat                   405
Tangra                     369
Dum Dum                    316
Garia                      307
                          ...
Kestopur                     1
Nandi Bagan                  1
Action Area IIB Newtown      1
Kudgat                       1
Nayabad Daspara              1
Name: location, Length: 308, dtype: int64
********************
2.0     3367
3.0     1589
4.0      612
1.0      381
5.0      244
6.0      130
7.0       69
8.0       33
9.0       24
10.0      10
12.0       3
11.0       2
16.0       2
15.0       1
27.0       1
40.0       1
14.0       1
Name: bathrooms, dtype: int64
********************
3     2903
2     2022
4      794
1      625
5       90
6       32
7       13
8       10
9        8
10       6
11       2
16       1
13       1
Name: bhk, dtype: int64
********************
Super built-up Area    4279
Built-up Area          1183
Plot Area               992
Carpet Area              53
Name: area_type, dtype: int64
********************

In [7]:
data.isna().sum()

price         0
sqft          0
location      0
bathrooms    37
bhk           0
area_type     0
dtype: int64

In [8]:
data.describe()

             price          sqft    bathrooms          bhk
count  6507.000000   6507.000000  6470.000000  6507.000000
mean     85.085697   1344.166897     2.717002     2.697095
std     146.593896    807.698043     1.435630     1.022644
min      20.000000    350.000000     1.000000     1.000000
25%      33.000000    920.000000     2.000000     2.000000
50%      49.400000   1144.000000     2.000000     3.000000
75%      80.000000   1454.000000     3.000000     3.000000
max    5040.000000  10000.000000    40.000000    16.000000

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6507 entries, 0 to 6506
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      6507 non-null   float64
 1   sqft       6507 non-null   int64
 2   location   6507 non-null   object
 3   bathrooms  6470 non-null   float64
 4   bhk        6507 non-null   int64
 5   area_type  6507 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 305.1+ KB

In [10]:
data['location'].value_counts()

New Town                   711
Rajarhat                   405
Tangra                     369
Dum Dum                    316
Garia                      307
                          ...
Kestopur                     1
Nandi Bagan                  1
Action Area IIB Newtown      1
Kudgat                       1
Nayabad Daspara              1
Name: location, Length: 308, dtype: int64

In [11]:
data['location'] = data['location'].fillna('Tangra')

In [12]:
data['bhk'].value_counts()

3     2903
2     2022
4      794
1      625
5       90
6       32
7       13
8       10
9        8
10       6
11       2
16       1
13       1
Name: bhk, dtype: int64

In [13]:
data['bhk'] = data['bhk'].fillna('2')

In [14]:
data['bathrooms'] = data['bathrooms'].fillna(data['bathrooms'].median())

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6507 entries, 0 to 6506
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      6507 non-null   float64
 1   sqft       6507 non-null   int64
 2   location   6507 non-null   object
 3   bathrooms  6507 non-null   float64
 4   bhk        6507 non-null   int64
 5   area_type  6507 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 305.1+ KB

In [16]:
data[data.bhk > 20]

Empty DataFrame
Columns: [price, sqft, location, bathrooms, bhk, area_type]
Index: []

In [17]:
data['sqft'].unique()

array([1016, 1111, 1020, ..., 1002, 1369,  968], dtype=int64)

In [18]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [19]:
data.head()

      price  sqft     location  bathrooms  bhk            area_type
0  22.35000  1016      Barasat        2.0    1  Super built-up Area
1  36.65999  1111    Keshtopur        5.0    3            Plot Area
2  37.74000  1020     Rajarhat        2.0    3        Built-up Area
3  25.24000   935  Narendrapur        3.0    2  Super built-up Area
4  83.00000  1956     New Town        2.0    4  Super built-up Area

# Price Per Square Feet

In [20]:
data['location'].value_counts()

New Town                   711
Rajarhat                   405
Tangra                     369
Dum Dum                    316
Garia                      307
                          ...
Kestopur                     1
Nandi Bagan                  1
Action Area IIB Newtown      1
Kudgat                       1
Nayabad Daspara              1
Name: location, Length: 308, dtype: int64

In [21]:
data['location'] = data['location'].apply(lambda x: x.strip())

In [22]:
data['location']

0           Barasat
1         Keshtopur
2          Rajarhat
3       Narendrapur
4          New Town
           ...
6502      Lake Town
6503    Narendrapur
6504       Rajarhat
6505       Kaikhali
6506         Howrah
Name: location, Length: 6507, dtype: object

In [23]:
location_count = data['location'].value_counts()

In [24]:
location_count

New Town                   711
Rajarhat                   405
Tangra                     369
Dum Dum                    316
Garia                      307
                          ...
Kestopur                     1
Nandi Bagan                  1
Action Area IIB Newtown      1
Kudgat                       1
Nayabad Daspara              1
Name: location, Length: 308, dtype: int64

In [25]:
location_count_less_10 = location_count[location_count <= 10]
location_count_less_10

Ganguly Bagan              10
Airport                    10
Dhakuria Station Road      10
Topsia Road                10
Baghajatin                 10
                           ..
Kestopur                    1
Nandi Bagan                 1
Action Area IIB Newtown     1
Kudgat                      1
Nayabad Daspara             1
Name: location, Length: 230, dtype: int64

In [26]:
data['location'] = data['location'].apply(lambda x: 'Other' if x in location_count_less_10 else x)

In [27]:
data['location'].value_counts()

New Town                        711
Other                           709
Rajarhat                        405
Tangra                          369
Dum Dum                         316
                               ...
Durgapur                         12
Naktala                          12
Hooghly Chinsurah                11
Elgin                            11
N S C Bose Road  Narendrapur     11
Name: location, Length: 79, dtype: int64

# Outliers Detection and Removal

In [28]:
(data['sqft'] / data['bhk']).describe()

count    6507.000000
mean      587.897689
std       485.578019
min        68.181818
25%       323.666667
50%       450.000000
75%       660.000000
max      7000.000000
dtype: float64

In [29]:
data = data[((data['sqft']/data['bhk']) >= 300)]
data.describe()

             price          sqft    bathrooms          bhk
count  5277.000000   5277.000000  5277.000000  5277.000000
mean     87.885203   1454.717453     2.701345     2.454614
std     141.011217    854.565735     1.398805     0.801153
min      20.000000    576.000000     1.000000     1.000000
25%      34.000000   1000.000000     2.000000     2.000000
50%      50.500000   1226.000000     2.000000     3.000000
75%      80.430000   1537.000000     3.000000     3.000000
max    1900.000000  10000.000000    40.000000     8.000000

In [30]:
data.shape

(5277, 6)

In [31]:
data.price.describe()

count    5277.000000
mean       87.885203
std       141.011217
min        20.000000
25%        34.000000
50%        50.500000
75%        80.430000
max      1900.000000
Name: price, dtype: float64

In [32]:
def remove_outliers_sqft(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m = np.mean(subdf.price)
        st = np.std(subdf.price)
        gen_df = subdf[(subdf.price > (m-st)) & (subdf.price <= (m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index =True)
    return df_output
data = remove_outliers_sqft(data)
data.describe()

            price          sqft    bathrooms          bhk
count  4821.00000   4821.000000  4821.000000  4821.000000
mean     57.55622   1415.127774     2.698195     2.449907
std      35.66875    781.069371     1.311130     0.799008
min      20.00000    576.000000     1.000000     1.000000
25%      33.00000   1000.000000     2.000000     2.000000
50%      47.52000   1216.000000     2.000000     2.000000
75%      72.75000   1523.000000     3.000000     3.000000
max     574.00000  10000.000000    16.000000     7.000000

In [33]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, loc_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in loc_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price),
                'std': np.std(bhk_df.price),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in loc_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [34]:
data = bhk_outlier_remover(data)

In [35]:
data.shape

(2590, 6)

In [36]:
data

       price  sqft       location  bathrooms  bhk            area_type
0     574.00  4995        Alipore        1.0    3  Super built-up Area
1     520.00  4995        Alipore        3.0    2  Super built-up Area
2     450.00  4100        Alipore        1.0    3  Super built-up Area
3     426.00  3391        Alipore        3.0    2  Super built-up Area
4     111.00  2665        Alipore        5.0    1            Plot Area
...      ...   ...            ...        ...  ...                  ...
4816   32.40  1274  south dum dum        3.0    3  Super built-up Area
4817   28.98   810  south dum dum        2.0    2        Built-up Area
4818   37.82  1126  south dum dum        1.0    3  Super built-up Area
4819   32.00   900  south dum dum        2.0    3  Super built-up Area
4820   55.00  1281  south dum dum        5.0    3            Plot Area

[2590 rows x 6 columns]

# Cleaned Data

In [37]:
data.drop(columns=['area_type'],inplace=True)
data.head()

   price  sqft location  bathrooms  bhk
0  574.0  4995  Alipore        1.0    3
1  520.0  4995  Alipore        3.0    2
2  450.0  4100  Alipore        1.0    3
3  426.0  3391  Alipore        3.0    2
4  111.0  2665  Alipore        5.0    1

In [38]:
data.to_csv("Kolkata_Cleaned_data.csv")

In [39]:
X = data.drop(columns=['price'])
y = data['price']

In [40]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [41]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2, random_state=0)

In [42]:
print(X_train.shape)
print(X_test.shape)

(2072, 4)
(518, 4)

# Applying Linear Regression

In [43]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False), ['location']),remainder='passthrough')

In [44]:
scaler = StandardScaler()

In [45]:
lr = LinearRegression(normalize=True)

In [46]:
pipe = make_pipeline(column_trans,scaler,lr)

In [47]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [48]:
y_pred_lr = pipe.predict(X_test)

In [49]:
r2_score(y_test, y_pred_lr)

0.10772988964164809

# Applying Lasso

In [50]:
lasso = Lasso()

In [51]:
pipe = make_pipeline(column_trans, scaler, lasso)

In [52]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [53]:
y_pred_lasso = pipe.predict(X_test)

In [54]:
r2_score(y_test, y_pred_lasso)

0.1263416290744931

# Applying Ridge

In [55]:
ridge = Ridge()

In [56]:
pipe = make_pipeline(column_trans, scaler, ridge)

In [57]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [58]:
y_pred_ridge = pipe.predict(X_test)

In [59]:
r2_score(y_test, y_pred_ridge)

0.1092218657754993

In [60]:
print("Linear Regression: ", r2_score(y_test, y_pred_lr))
print("Lasso: ", r2_score(y_test, y_pred_lasso))
print("Ridge: ", r2_score(y_test, y_pred_ridge))

Linear Regression:  0.10772988964164809
Lasso:  0.1263416290744931
Ridge:  0.1092218657754993

In [61]:
import pickle

In [62]:
pickle.dump(pipe, open('KolkataRidgeModel.pkl', 'wb'))